Municípios/M4313300/Exemplos/Envelopamento SOAP/ConsultaNFSePorRPS.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<mConsultaNFSePorRPS xmlns="http://tempuri.org/">
			<remessa>
				<![CDATA[<ConsultarNfseRpsEnvio xmlns="http://www.abrasf.org.br/nfse.xsd"><IdentificacaoRps><Numero>8</Numero><Serie>UNICA</Serie><Tipo>1</Tipo></IdentificacaoRps><Prestador><CpfCnpj><Cnpj>99999999999962</Cnpj></CpfCnpj><RazaoSocial>TESTE</RazaoSocial><InscricaoMunicipal>11719</InscricaoMunicipal></Prestador></ConsultarNfseRpsEnvio>]]></remessa>
			<cabecalho>
				<![CDATA[<cabecalho xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://www.abrasf.org.br/nfse.xsd" <versaoDados>20.01</versaoDados> </cabecalho>]]></cabecalho>
		</mConsultaNFSePorRPS>
	</soap:Body>
</soap:Envelope>